# --------------------------------
# 함수(Function) 이해 및 활용
# ------------------------------------
# 함수기능 : 3개의 정수를 덧셈 후 결과를 반환하는 함수
# 함수이름 : add3
# 매개변수 : num1, num2, num3
# 함수결과 : 정수 result
# ----------------------------------------
def add3(num1, num2, num3):
    result=num1+num2+num3
    return result

# ------------------------------------
# 함수기능 : 3개의 정수를 곱셈 후 결과를 반환하는 함수
# 함수이름 : multi3
# 매개변수 : num1, num2, num3
# 함수결과 : 정수 result
# ----------------------------------------
def multi3(num1, num2, num3):
    result=num1*num2*num3
    return result

# ------------------------------------
# 함수기능 : 2개의 정수를 나눗셈 한 결과를 출력하는 함수
# 함수이름 : div
# 매개변수 : num1, num2
# 함수결과 : none
# ----------------------------------------
def div(num1, num2):
    if not num2:    # not 0 -------> True
        print(num1/num2)
        print('0으로 나눌 수 없음')
    else:
        print(num1/num2)

## 함수 사용하기 즉, 호출 -----------------
## 덧셈하기
value=add3(1,2,3)

## 나눗셈하기
value1=div(3,4)

print(value1)