# -------------------------------------------------
# 3.7 
# -------------------------------------------------

print('Hello, world!')
print('Python Programing')


# -------------------------------------------------
# 3.8
# -------------------------------------------------

print('Hello, world!')
print('Hello, world!')

# -------------------------------------------------
# 5.5
# -------------------------------------------------

dis=12
apt=0.247*dis+4.159
print(f'소음이 가장 심한 층수는 {int(apt)}')

# -------------------------------------------------
# 5.6
# -------------------------------------------------

ap=102
dmg=ap*0.6+225
print(f'왜곡의 스킬 피해량 : {dmg}')


# -------------------------------------------------
# 6.6
# -------------------------------------------------

a, b, c = map(int, input('정수 3개를 입력해주세요 : ').split())
print(a+b+c)


# -------------------------------------------------
# 6.7
# -------------------------------------------------

a, b, c = input('변수 a b c를 입력하세요 :').split()
print(a)
print(b)
print(c)

# -------------------------------------------------
# 6.8
# -------------------------------------------------

a, b, c, d = map(int, input().split())
print(int((a+b+c+d)/4))

# -------------------------------------------------
# 7.4
# -------------------------------------------------
year = 2000
month = 10
day = 27
hour = 11
minute = 43
second = 59

print(year, month, day , sep='/', end=' ')
print(hour, minute, second, sep=':')

# -------------------------------------------------
# 7.5
# -------------------------------------------------
year, month, day, hour, minute, second = input().split()
print(year, month, day, sep='-', end='T')
print(hour, minute, second, sep=':')

# -------------------------------------------------
# 8.4
# -------------------------------------------------
korean=92
english=47
mathematics=86
science=81

print(korean>=50 and english>=50 and mathematics>=50 and science>=50)
# -------------------------------------------------
# 8.5
# -------------------------------------------------
kr, en, math, si = map(int, input().split())
print( kr>=90 and en>80 and math>85 and si>=80)

# -------------------------------------------------
# 9.3
# -------------------------------------------------
s='''Python is a programing language that lets you work quickly
and
intergrate systems more effectively'''

print(s)

# -------------------------------------------------
# 9.4
# -------------------------------------------------
s=''''Python' is a "programing language" 
that lets you work quickly
and
intergrate systems more effectively'''

print(s)